РП/src/InformationRegisters/ОтражениеДокументовВРеглУчете/ОтражениеДокументовВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеДокументовВРеглУчете</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтраженияДокументовВРеглУчете</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтражения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/Enums/СтатусыОтраженияДокументовВРеглУчете/СтатусыОтраженияДокументовВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтраженияДокументовВРеглУчете</name>
  <enumValues>
    <name>КОтражениюВРеглУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтраженоВРеглУчете</name>
  </enumValues>
  <enumValues>
    <name>НеУказаныСчетаУчета</name>
  </enumValues>
  <enumValues>
    <name>ОтраженоВУчетеВручную</name>
  </enumValues>
  <enumValues>
    <name>КОтражениюВУчетеВручную</name>
  </enumValues>
</mdclass:Enum>

РП/src/InformationRegisters/ОтражениеДокументовВРеглУчете/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОтражениеДокументовВРеглУчете" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если СтрокаСписка <> Неопределено Тогда
	
		СтруктураПараметры = Новый Структура("Регистратор, Организация",
			СтрокаСписка.Регистратор,
			СтрокаСписка.Организация);
		ОткрытьФорму("РегистрСведений.ОтражениеДокументовВРеглУчете.Форма.ФормаРедактированияЗаписи", СтруктураПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСтатусКОтражению(Команда)
	
	ВыделенныеСтроки = РаботаСДиалогамиКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		ТекстВопроса = НСтр("ru='У выделенных в списке документов будет установлен статус ""К отражению в регл. учете"". Продолжить?';uk='У виділених в списку документів буде встановлено статус ""До відображення в регл. обліку"". Продовжити?'");
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьСтатусКОтражениюЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	УстановитьСтатусКОтражениюФрагмент(ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусКОтражениюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
    
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    УстановитьСтатусКОтражениюФрагмент(ВыделенныеСтроки);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусКОтражениюФрагмент(Знач ВыделенныеСтроки)
    
    Перем КоличествоОбработанных;
    
    КоличествоОбработанных = УстановитьСтатус(ВыделенныеСтроки, "КОтражениюВРеглУчете");
    
    ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбУстановкеСтатуса(Элементы.Список, КоличествоОбработанных, ВыделенныеСтроки.Количество(), НСтр("ru='К отражению в регл. учете';uk='До відображення в регл. обліку'"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

&НаСервере
Функция УстановитьСтатус(Знач МассивСтрок, Знач НовыйСтатус)
	
	ЗначениеНовогоСтатуса = Перечисления.СтатусыОтраженияДокументовВРеглУчете[НовыйСтатус];
	
	КоличествоОбработанных = 0;
	Для Каждого СтрокаСписка Из МассивСтрок Цикл
		ЗаписатьДанныеРегистра(СтрокаСписка.Регистратор, ЗначениеНовогоСтатуса, КоличествоОбработанных);
	КонецЦикла;
	
	Возврат КоличествоОбработанных;
	
КонецФункции

&НаСервере
Процедура ЗаписатьДанныеРегистра(Регистратор, НовыйСтатус, КоличествоОбработанных)
	
	НаборЗаписей = РегистрыСведений.ОтражениеДокументовВРеглУчете.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.Статус <> НовыйСтатус Тогда
			Запись.Статус = НовыйСтатус;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборЗаписей.Модифицированность() Тогда
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Записать();
		КоличествоОбработанных = КоличествоОбработанных + 1;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
